#### Ceramic Members

---

|  |
| --- |
| Ceramic Class   Properties   See Also |

The  Ceramic  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CeramicApplication | The property labeled "Finish" from the "Ceramic" schema. |
| Public property Static member | CeramicBump | The property labeled "Type" from the "Ceramic" schema. |
| Public property Static member | CeramicBumpAmount | The property labeled "Amount" from the "Ceramic" schema. |
| Public property Static member | CeramicBumpMap | The property labeled "Image" from the "Ceramic" schema. |
| Public property Static member | CeramicColor | The property labeled "Color" from the "Ceramic" schema. |
| Public property Static member | CeramicColorByObject | The property labeled "Color" from the "Ceramic" schema. |
| Public property Static member | CeramicPattern | The property labeled "Relief Pattern" from the "Ceramic" schema. |
| Public property Static member | CeramicPatternAmount | The property labeled "Amount" from the "Ceramic" schema. |
| Public property Static member | CeramicPatternMap | The property labeled "Image" from the "Ceramic" schema. |
| Public property Static member | CeramicType | The property labeled "Type" from the "Ceramic" schema. |
| Public property Static member | CommonTintColor | The property labeled "Tint Color" from the "Ceramic" schema. |
| Public property Static member | CommonTintToggle | The property labeled "Tint" from the "Ceramic" schema. |

# See Also

Ceramic Class

Autodesk.Revit.DB.Visual Namespace